
&НаСервере
Функция ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОстаткиНаКартеОстатки.СуммаСписанияОстаток КАК СуммаСписанияОстаток
	|ИЗ
	|	РегистрНакопления.ОстаткиНаКарте.Остатки КАК ОстаткиНаКартеОстатки";
	РезульатЗапроса = Запрос.Выполнить();
	Выборка = РезульатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		
		СуммаСписаний = СуммаСписаний + Выборка.СуммаСписанияОстаток;
		
	КонецЦикла;
	
	//Если СуммаСписаний < 0 Тогда 
	//	СуммаСписаний = -СуммаСписаний
	//КонецЕсли;
	
	Возврат СуммаСписаний;
		
КонецФункции
