
#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	ВывестиПриветствие();	
КонецПроцедуры 

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

&НаСервере
Процедура ВывестиПриветствие() Экспорт 
	
	Счет			  = 0;
	Час				  = Час(ТекущаяДата());
	Пользователь	  = ПользователиИнформационнойБазы.ТекущийПользователь().Имя;
	МассивПриветствий = МодульПриветсвий.СформироватьТаблицуПриветствий();
	
	Для Каждого Правило Из МассивПриветствий Цикл 
		
		Если Счет <> 3 Тогда 
			
			Если Час >= Правило.Начало И Час < Правило.Конец Тогда		
				ЭтаФорма.Заголовок = Правило.Текст + Пользователь + "!";				
			КонецЕсли;
			
		Иначе 
			
			Если Час >= Правило.Начало Или Час < Правило.Конец Тогда
				ЭтаФорма.Заголовок = Правило.Текст + Пользователь + "!";				
			КонецЕсли;
			
		КонецЕсли;
		
		Счет = Счет +1;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
