
#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВывестиКоличествоСотрудников();
	
КонецПроцедуры

&НаСервере
Процедура ВывестиКоличествоСотрудников() Экспорт 

	Элементы.Список.Обновить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Сотрудники.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники";
	
	РезультатЗапрос = Запрос.Выполнить();
	Выборка			= РезультатЗапрос.Выбрать();
	
	КоличествоСотрудников = Выборка.Количество();
	
КонецПроцедуры

&НаКлиенте
Процедура КодПриИзменении(Элемент)

	Отказ = Ложь;
	СтандартнаяОбработка = Истина;
	
	ПриСозданииНаСервере(Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область Команды

// . . .

#КонецОбласти
