
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ОстаткиНаКарте.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОперацииПоКартеСписокТранзакций.Ссылка КАК Ссылка,
	|	ОперацииПоКартеСписокТранзакций.НомерСтроки КАК НомерСтроки,
	|	ОперацииПоКартеСписокТранзакций.НаименованиеТранзакции КАК НаименованиеТранзакции,
	|	ОперацииПоКартеСписокТранзакций.Сумма КАК Сумма,
	|	ОперацииПоКартеСписокТранзакций.Валюта КАК Валюта
	|ИЗ
	|	Документ.ОперацииПоКарте.СписокТранзакций КАК ОперацииПоКартеСписокТранзакций
	|ГДЕ
	|	ОперацииПоКартеСписокТранзакций.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		
		Движение = Движения.ОстаткиНаКарте.Добавить();
		
		Если ТипОперации = Перечисления.ТипОперацииДляКарты.ПополнениеСредств Тогда 
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Иначе 
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		КонецЕсли;
		
		Движение.Период = Дата;
		Движение.НаименованиеТранзакции = Выборка.НаименованиеТранзакции;
		Движение.Валюта = Выборка.Валюта;
		Движение.СуммаСписания = Выборка.Сумма;
		
	КонецЦикла;
						
КонецПроцедуры
