
Функция СформироватьТаблицуПриветствий() Экспорт 
	
	МассивПриветствий = Новый Массив;
	
	МассивПриветствий.Добавить(Новый Структура("Начало,Конец,Текст", 5, 12, "Доброе утро, "));
	МассивПриветствий.Добавить(Новый Структура("Начало,Конец,Текст", 12, 18, "Добрый день, "));
	МассивПриветствий.Добавить(Новый Структура("Начало,Конец,Текст", 18, 23, "Добрый вечер, "));
	МассивПриветствий.Добавить(Новый Структура("Начало,Конец,Текст", 23, 5, "Доброй ночи, "));
	
	Возврат МассивПриветствий;
	
КонецФункции