
Функция ЗаписатьБалансКарты() Экспорт 

	БалансКарты = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОстаткиНаКартеОстатки.НаименованиеТранзакции КАК НаименованиеТранзакции,
	|	ОстаткиНаКартеОстатки.Валюта КАК Валюта,
	|	ОстаткиНаКартеОстатки.СуммаСписанияОстаток КАК СуммаСписанияОстаток
	|ИЗ
	|	РегистрНакопления.ОстаткиНаКарте.Остатки КАК ОстаткиНаКартеОстатки";
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл 		
		БалансКарты = БалансКарты + Выборка.СуммаСписанияОстаток;	
	КонецЦикла;
	
	Константы.БалансКарты.Установить(БалансКарты);
	
	Возврат БалансКарты;
	
КонецФункции