
#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекущийПользователь = ПользователиИнформационнойБазы.ТекущийПользователь().Имя;
	Администратор		= "Добрынин Андрей";
	
	Если РольДоступна("ПолныеПрава") И ТекущийПользователь = Администратор Тогда	
		Элементы.ЗначенияТипаБулево.Видимость = Истина;		
	Иначе 
		Элементы.ЗначенияТипаБулево.Видимость = Ложь;
	КонецЕсли;
	
	Если Объект.Выполнена = Истина Тогда 
		Объект.ЗадачаПросрочена = Ложь;
	КонецЕсли;
	
	ОценкаТрудоемкостиЗадачи = Объект.ОценкаТрудоемкости;
	
	ЗадачаБыстрая = Перечисления.ОценкиТрудоемкости.Быстро;
	ЗадачаСредняя = Перечисления.ОценкиТрудоемкости.Средне;
	ЗадачаДолгая  = Перечисления.ОценкиТрудоемкости.Долго;
	
	Если ОценкаТрудоемкостиЗадачи = ЗадачаБыстрая Тогда 
		
		Элементы.ОценкаТрудоемкости.ЦветРамки = Новый Цвет(12, 220, 64);
		
	ИначеЕсли ОценкаТрудоемкостиЗадачи = ЗадачаСредняя Тогда 
		
		Элементы.ОценкаТрудоемкости.ЦветРамки = Новый Цвет(255, 213, 0);
		
	ИначеЕсли ОценкаТрудоемкостиЗадачи = ЗадачаДолгая Тогда 
		
		Элементы.ОценкаТрудоемкости.ЦветРамки = Новый Цвет(173, 26, 21);
		
	Иначе 
		
		Элементы.ОценкаТрудоемкости.ЦветРамки = Новый Цвет(200, 170, 160);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ВыгрузкаИзЗапроса = ВыполнитьЗапросДляИсполнителя();
	
	Если Объект.Выполнена <> Истина Тогда 
		
		Если ВыгрузкаИзЗапроса.Количество() > 0 Тогда 
			
			Уведомление = "Вам пришла задача!" + Символы.ПС + Объект.Наименование;
			
			МодульTelegram.SendMessage(ВыгрузкаИзЗапроса[0].ID, Уведомление);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПередВыполнениемНаСервере()
	
	ЗадачаВнедрена = Перечисления.СостояниеЗадач.Внедрено;
	
	Возврат ЗадачаВнедрена;
	
КонецФункции

&НаКлиенте
Процедура ПередВыполнением(Отказ)
	
	ЗадачаВнедрена		   = ПередВыполнениемНаСервере();	
	Объект.СостояниеЗадачи = ЗадачаВнедрена; 	
	
	ОтправитьВТелеграм();
	
КонецПроцедуры

&НаСервере
Процедура ОценкаТрудоемкостиПриИзмененииНаСервере()
	
	ОценкаТрудоемкостиЗадачи = Объект.ОценкаТрудоемкости;
	
	ЗадачаБыстрая = Перечисления.ОценкиТрудоемкости.Быстро;
	ЗадачаСредняя = Перечисления.ОценкиТрудоемкости.Средне;
	ЗадачаДолгая  = Перечисления.ОценкиТрудоемкости.Долго;
	
	Если ОценкаТрудоемкостиЗадачи = ЗадачаБыстрая Тогда 
		
		Элементы.ОценкаТрудоемкости.ЦветРамки = Новый Цвет(12, 220, 64);
		
	ИначеЕсли ОценкаТрудоемкостиЗадачи = ЗадачаСредняя Тогда 
		
		Элементы.ОценкаТрудоемкости.ЦветРамки = Новый Цвет(255, 213, 0);
		
	ИначеЕсли ОценкаТрудоемкостиЗадачи = ЗадачаДолгая Тогда 
		
		Элементы.ОценкаТрудоемкости.ЦветРамки = Новый Цвет(173, 26, 21);
		
	Иначе 
		
		Элементы.ОценкаТрудоемкости.ЦветРамки = Новый Цвет(200, 170, 160);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОценкаТрудоемкостиПриИзменении(Элемент)
	ОценкаТрудоемкостиПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти

#Область РаботаСДанными

&НаСервере
Процедура ОтправитьВТелеграм()
	
	ВыгрузкаИзЗапроса = ВыполнитьЗапросДляНазначающего();
	
	Уведомление = "Здрваствуйте, " 
	+ МодульВидовТекста.Жирный(Строка(ВыгрузкаИзЗапроса[0].Сотрудник.ИмяОтчество)) 
	+ "! Задача: " + "«" 
	+ МодульВидовТекста.Подчеркнутый(Строка(Объект.Наименование)) 
	+ "»" + ", который выполнил сотрудник " 
	+ МодульВидовТекста.Жирный(Строка(Объект.Исполнитель))
	+ " была внедрена!";
	
	МодульTelegram.SendMessage(ВыгрузкаИзЗапроса[0].ID, Уведомление,, "HTML");
	
КонецПроцедуры

&НаСервере
Функция ВыполнитьЗапросДляИсполнителя() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УчетныеЗаписиTelegram.ID КАК ID,
	|	УчетныеЗаписиTelegram.Сотрудник КАК Сотрудник
	|ИЗ
	|	Справочник.УчетныеЗаписиTelegram КАК УчетныеЗаписиTelegram
	|ГДЕ
	|	ВЫРАЗИТЬ(УчетныеЗаписиTelegram.Сотрудник КАК Справочник.Сотрудники) В (&Исполнитель)
	|	И НЕ УчетныеЗаписиTelegram.ПометкаУдаления";
	Запрос.УстановитьПараметр("Исполнитель", Объект.Исполнитель);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выгрузка		 = РезультатЗапроса.Выгрузить();
	
	Возврат Выгрузка;
	
КонецФункции

&НаСервере
Функция ВыполнитьЗапросДляНазначающего()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УчетныеЗаписиTelegram.ID КАК ID,
	|	УчетныеЗаписиTelegram.Сотрудник КАК Сотрудник,
	|	УчетныеЗаписиTelegram.Сотрудник.ИмяОтчество КАК СотрудникИмяОтчество
	|ИЗ
	|	Справочник.УчетныеЗаписиTelegram КАК УчетныеЗаписиTelegram
	|ГДЕ
	|	ВЫРАЗИТЬ(УчетныеЗаписиTelegram.Сотрудник КАК Справочник.Сотрудники) В (&Назначающий)
	|	И НЕ УчетныеЗаписиTelegram.ПометкаУдаления";
	Запрос.УстановитьПараметр("Назначающий", Объект.Назначающий);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выгрузка		 = РезультатЗапроса.Выгрузить();
	
	Возврат Выгрузка;
	
КонецФункции

#КонецОбласти