
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура СтудентПриИзменении(Элемент)
	
	Отказ = Ложь;
	СтандартнаяОбработка = Истина;
	
	Студент = ПриСозданииНаСервере(Отказ, СтандартнаяОбработка);
	
	Если Студент Тогда 
		//ПредупреждениеАсинх("Заполните карточку студента!");
		Сообщить("Заполните карточку студента!");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Студент = Объект.Студент;
	
	Если Студент Тогда 
		Элементы.КарточкаСтудента.Видимость = Истина;
	Иначе 
		Элементы.КарточкаСтудента.Видимость = Ложь;
	КонецЕсли;
	
	Администратор = "Добрынин Андрей Дмитриевич";
	ТекущийПользователь = ПараметрыСеанса.ТекущийСотрудник.Код;
	
	Если РольДоступна("ПолныеПрава") И ТекущийПользователь = Администратор Тогда 
		Элементы.Администрирование.Видимость = Истина;
	Иначе 
		Элементы.Администрирование.Видимость = Ложь;
	КонецЕсли;
	
	Возврат Студент;
	
КонецФункции

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	//Запрос = Новый Запрос;
	//Запрос.Текст =
	//"ВЫБРАТЬ
	//|	Сотрудники.Ссылка КАК Ссылка,
	//|	Сотрудники.Код КАК Код,
	//|	Сотрудники.Отдел КАК Отдел
	//|ИЗ
	//|	Справочник.Сотрудники КАК Сотрудники
	//|ГДЕ
	//|	Сотрудники.Ссылка = &Ссылка
	//|	И Сотрудники.Код = &Код
	//|	И Сотрудники.Отдел = &Отдел";
	//
	//Запрос.УстановитьПараметр("Ссылка", ТекущийОбъект.Ссылка);
	//Запрос.УстановитьПараметр("Код", ТекущийОбъект.Код);
	//Запрос.УстановитьПараметр("Отдел", ТекущийОбъект.Отдел);
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//Если Не РезультатЗапроса.Пустой() Тогда 
	//	
	//	Сообщение = Новый СообщениеПользователю;
	//	Сообщение.Текст = "Такой сотрудник уже существует!";
	//	Сообщение.Сообщить();
	//	
	//	Отказ = Истина;
	//	
	//КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИнститутПриИзмененииНаСервере()
	
	Если Объект.Институт.Наименование = "Институт радиоэлектроники и информационных технологий–РтФ" Тогда 
		Объект.ГруппаСтудента = "РИ-";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИнститутПриИзменении(Элемент)
	ИнститутПриИзмененииНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПослеЗаписиНаСервере()
	// . . .	
КонецФункции

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ПослеЗаписиНаСервере();
	
	//ФормаСписка = Неопределено;
	//ФормаСписка.Обновить();
	
	ЭтаФорма.Закрыть(); // не работает!
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Выборка = Справочники.Сотрудники.Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		
		ПользовательИБ = Неопределено;
		
		ВсеПользователи = ПользователиИнформационнойБазы.ПолучитьПользователей();
		
		Для Каждого Польз Из ВсеПользователи Цикл
			
			Если Польз.ПолноеИмя = СокрЛП(Выборка.Код) Тогда
				
				ПользовательИБ = Польз;
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если ПользовательИБ <> Неопределено Тогда 
			
			СотрудникОбъект = Выборка.ПолучитьОбъект();
			СотрудникОбъект.ИдентификаторПользователяИБ = ПользовательИБ.УникальныйИдентификатор;
			СотрудникОбъект.Записать();
			
		КонецЕсли;
		
	КонецЦикла;		
	
КонецПроцедуры

#КонецОбласти

#Область Команды

&НаСервере
Процедура ДиагностикаНаСервере()
	
	ВсеПользователи = ПользователиИнформационнойБазы.ПолучитьПользователей();
	Для Каждого Польз Из ВсеПользователи Цикл
		Сообщить("Пользователь ИБ: [" + Польз.Имя + "]");
	КонецЦикла;
	
	Сообщить("Код сотрудника: [" + СокрЛП(Объект.Код) + "]");
	
КонецПроцедуры

&НаКлиенте
Процедура Диагностика(Команда)
	ДиагностикаНаСервере();
КонецПроцедуры

#КонецОбласти
