
&НаСервере
Процедура ПолучитьСообщениеНаСервере()
	
	СоединениеHTTP = Новый HTTPСоединение("api.telegram.org", 443,,,,, Новый ЗащищенноеСоединениеOpenSSL(),);
	
	ЗапросHTTP = Новый HTTPЗапрос;
	ЗапросHTTP.Заголовки.Вставить("Content-type", "application/json");
	ЗапросHTTP.АдресРесурса = "bot" + Константы.TelegramТокен.Получить() + "/" + "getUpdates";
	
	ОтветHTTP = СоединениеHTTP.Получить(ЗапросHTTP);
	
	Если ОтветHTTP.КодСостояния = 200 Тогда 
		РезультатЗапроса = ФорматироватьJSON(ОтветHTTP.ПолучитьТелоКакСтроку());
	КонецЕсли;
	
	МодульTelegram.ЗагрузитьСообщенияИзТелеграм();
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСообщение(Команда)
	ПолучитьСообщениеНаСервере();
КонецПроцедуры

Функция ФорматироватьJSON(СтрокаJSON) Экспорт 
	
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(СтрокаJSON);
	ОбъектJSON = ПрочитатьJSON(Чтение);
	Чтение.Закрыть();
	
	ПараметрыЗаписи = Новый ПараметрыЗаписиJSON(, Символы.Таб);
	
	Запись = Новый ЗаписьJSON;
	Запись.УстановитьСтроку(ПараметрыЗаписи);
	ЗаписатьJSON(Запись, ОбъектJSON);
	
	Возврат Запись.Закрыть();
	
КонецФункции

&НаСервере
Процедура ОтправитьСообщениеНаСервере()
	МодульTelegram.SendMessage(1536145203, Сообщение);	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСообщение(Команда)
	ОтправитьСообщениеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтправитьТекущийБалансКартыНаСервере()	
	
	ТекущийПользователь = ПользователиИнформационнойБазы.ТекущийПользователь().ПолноеИмя;
	
	Если РольДоступна("ПолныеПрава") И Не ТекущийПользователь = "Добрынин Андрей Дмитриевич" Тогда 	
		МодульTelegram.SendMessage(1536145203, "Ваш текущий баланс карты: " + Константы.БалансКарты.Получить() + " рублей");	
	Иначе 	
		Сообщить("Недостаточно прав!");	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтправитьТекущийБалансКарты(Команда)
	ОтправитьТекущийБалансКартыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьРезультатЗапросаНаСервере()
	МодульСотрудников.ПолучитьTelegramIDТекущегоПользователя();
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьРезультатЗапроса(Команда)
	ВыгрузитьРезультатЗапросаНаСервере();
КонецПроцедуры
