
#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Администратор = "Добрынин Андрей Дмитриевич";
	
	Если Не ПользователиИнформационнойБазы.ТекущийПользователь().ПолноеИмя = Администратор Тогда
		
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Исполнитель");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = ПараметрыСеанса.ТекущийСотрудник;
		ЭлементОтбора.Использование = Истина;
		
	КонецЕсли;
	
	МодульЗадач.ОбновитьПросроченныеЗадачи();
		
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	Для Каждого СтрокаДанных Из Строки Цикл
		
		СтрокаТаблицы = СтрокаДанных.Значение;
		
		Если СтрокаТаблицы.Данные["ЗадачаПросрочена"] = Истина Тогда
			
			Для Каждого Ячейка Из СтрокаТаблицы.Оформление Цикл
				
				Ячейка.Значение.УстановитьЗначениеПараметра(
				Новый ПараметрКомпоновкиДанных("ЦветФона"), 
				Новый Цвет(255, 200, 200));
				
				Ячейка.Значение.УстановитьЗначениеПараметра(
				Новый ПараметрКомпоновкиДанных("ЦветТекста"), 
				Новый Цвет(180, 0, 0));
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти