
#Область Команды

&НаСервере
Процедура DeleteWebhookНаСервере()
	
	// . . .
	
КонецПроцедуры

&НаКлиенте
Процедура DeleteWebhook(Команда)
	DeleteWebhookНаСервере();
КонецПроцедуры

&НаСервере
Функция GetWebhookInfoНаСервере()
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку();
	СтруктураJSON = ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();
	
КонецФункции

&НаКлиенте
Процедура GetWebhookInfo(Команда)
	Сообщить("" + GetWebhookInfoНаСервере());
КонецПроцедуры

&НаСервере
Процедура ПодключитьWebhookНаСервере()
	
	// . . .
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьWebhook(Команда)
	ПодключитьWebhookНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) Экспорт 
	// . . .	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	URL = ПараметрЗапуска;
	
	Если ПустаяСтрока(URL) Тогда
		Возврат;
	КонецЕсли;
	
	WebhookURL = "https://webhook:@" + URL + "/SGIS/hs/telegram/";
	
	УстановитьWebhookНаСервере(WebhookURL);
	
	ЗавершитьРаботуСистемы();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьWebhookНаСервере(WebhookURL)
	
	Результат = МодульTelegram.SetWebhook(WebhookURL);
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Результат);
	Сообщить("Webhook: " + ЗаписьJSON.Закрыть());
	
КонецПроцедуры

#КонецОбласти
