
#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Пользователь = ПользователиИнформационнойБазы.ТекущийПользователь().Имя;
	
	Если РольДоступна("ПолныеПрава") И Пользователь = "Добрынин Андрей" Тогда 
		
		Элементы.Все_Администрирование.Видимость = Истина;
		Элементы.Администрирование.Видимость = Истина;
		
	Иначе 
		
		Элементы.Все_Администрирование.Видимость = Ложь;
		Элементы.Администрирование.Видимость = Ложь;
		
	КонецЕсли;
	
	Если Пользователь = "Савченков Иван" Тогда 
		
		ДлинаИмени = 4;
		
	Иначе 
		
		ДлинаИмени = 6;
		
		Элементы.ЗаписатьБалансКарты.Видимость = Истина;
		Элементы.ЗаписатьБалансКарты1.Видимость = Истина;
		
	КонецЕсли;
	
	ВывестиПриветствие(ДлинаИмени);
	
	БалансКарты = МодульБанковскойКартыСервер.ЗаписатьБалансКарты();
	
	Элементы.БалансКартыНадпись.Заголовок = "Баланс расчетного счета: " 
	+ Символы.ПС + Строка(БалансКарты);
	
	НазваниеДня = СтрРазделить("Понедельник,Вторник,Среда,Четверг,Пятница,Суббота,Воскресенье", 
	",")[ДеньНедели(ТекущаяДата()) - 1];
	
	Элементы.ТекДата.Заголовок = "Сегодня: " + НазваниеДня + "," + Символы.ПС 
	+ Строка((Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy; ДЛФ=DDT")));
	
	КоличествоЗадач = МодульСотрудников.ПосчитатьЗадачиСотрудника();
	
	Элементы.КоличествоЗадач.Заголовок = "У вас на сегодня " + КоличествоЗадач + " " 
	+ СклонениеЗадач(КоличествоЗадач) + "!";
	
	КоличествоПросроченныхЗадач 
	= МодульЗадач.ПолучитьКоличествоПросроченныхЗадач();
	
	Элементы.КоличествоПросрочки.Заголовок = "Просрочено " + КоличествоПросроченныхЗадач 
	+ " " + СклонениеЗадач(КоличествоПросроченныхЗадач) + "!";
	
	//МодульTelegram.ЗагрузитьСообщенияИзТелеграм();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СчетчикСекунд = 0;
	ПодключитьОбработчикОжидания("ОбновитьДанные", 1, Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ПриПовторномОткрытииНаСервере()
	
	КоличествоЗадач = МодульСотрудников.ПосчитатьЗадачиСотрудника();
	
	Элементы.КоличествоЗадач.Заголовок = "У вас на сегодня " + КоличествоЗадач + " " 
	+ СклонениеЗадач(КоличествоЗадач) + "!";
	
	КоличествоПросроченныхЗадач 
	= МодульЗадач.ПолучитьКоличествоПросроченныхЗадач();
	
	Элементы.КоличествоПросрочки.Заголовок = "Просрочено " 
	+ КоличествоПросроченныхЗадач + " "
	+ СклонениеЗадач(КоличествоПросроченныхЗадач) + "!";
	
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	
	ПриПовторномОткрытииНаСервере();
	ПодключитьОбработчикОжидания("ОбновитьДанные", 1, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	ОтключитьОбработчикОжидания("ОбновитьДанные");
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьТаймерНаГлавной" Тогда 
		Таймер = Параметр;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеФункцииИПроцедуры

&НаСервере
Процедура ВывестиПриветствие(ДлинаИмени)
	
	Счет			  = 0;
	Час				  = Час(ТекущаяДата());
	МассивПриветствий = МодульПриветсвий.СформироватьТаблицуПриветствий();
	Пользователь	  = Прав(ПользователиИнформационнойБазы.ТекущийПользователь().Имя, ДлинаИмени);
	
	Для Каждого Правило Из МассивПриветствий Цикл 
		
		Если Счет <> 3 Тогда 
			
			Если Час >= Правило.Начало И Час < Правило.Конец Тогда 
				Элементы.Приветствие.Заголовок = Правило.Текст + Пользователь + "!";
			КонецЕсли;
			
		Иначе
			
			Если Час >= Правило.Начало Или Час < Правило.Конец Тогда 
				Элементы.Приветствие.Заголовок = Правило.Текст + Пользователь + "!";
			КонецЕсли;
			
		КонецЕсли;
		
		Счет = Счет + 1;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция СклонениеЗадач(Количество)
	
	Остаток11_19 = Количество % 100;
	Остаток1_9   = Количество % 10;
	
	Если Остаток11_19 >= 11 И Остаток11_19 <= 19 Тогда
		Возврат "задач";
	ИначеЕсли Остаток1_9 = 1 Тогда
		Возврат "задача";
	ИначеЕсли Остаток1_9 >= 2 И Остаток1_9 <= 4 Тогда
		Возврат "задачи";
	Иначе
		Возврат "задач";
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ОбновитьДанныеНаСервере()
	
	НазваниеДня = СтрРазделить("Понедельник,Вторник,Среда,Четверг,Пятница,Суббота,Воскресенье", 
	",")[ДеньНедели(ТекущаяДата()) - 1];
	
	Элементы.ТекДата.Заголовок = "Сегодня: " + НазваниеДня + "," + Символы.ПС 
	+ Строка((Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy; ДЛФ=DDT")));
	
	КоличествоЗадач = МодульСотрудников.ПосчитатьЗадачиСотрудника();
	
	Элементы.КоличествоЗадач.Заголовок = "У вас на сегодня " + КоличествоЗадач + " " 
	+ СклонениеЗадач(КоличествоЗадач) + "!";
	
	ХранениеБаланса = МодульБанковскойКартыСервер.ЗаписатьБалансКарты();
	
	Элементы.БалансКартыНадпись.Заголовок = "Баланс расчетного счета: " 
	+ Символы.ПС + Строка(ХранениеБаланса);
	
	КоличествоПросроченныхЗадач 
	= МодульЗадач.ПолучитьКоличествоПросроченныхЗадач();
	
	Элементы.КоличествоПросрочки.Заголовок = "Просрочено " + КоличествоПросроченныхЗадач 
	+ " " + СклонениеЗадач(КоличествоПросроченныхЗадач) + "!";
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанные()
	
	СчетчикСекунд = СчетчикСекунд + 1;
	
	Если СчетчикСекунд % 15 = 0 Тогда 
		ОбновитьДанныеНаСервере();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Команды

&НаКлиенте
Процедура ОткрытьДоску(Команда)
	ОткрытьФорму("Обработка.КанбанДоска.Форма.Форма");
КонецПроцедуры

&НаСервере
Процедура ЗаписатьБалансКартыНаСервере()
	
	Константы = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОстаткиНаКартеОстатки.НаименованиеТранзакции КАК НаименованиеТранзакции,
	|	ОстаткиНаКартеОстатки.Валюта КАК Валюта,
	|	ОстаткиНаКартеОстатки.СуммаСписанияОстаток КАК СуммаСписанияОстаток
	|ИЗ
	|	РегистрНакопления.ОстаткиНаКарте.Остатки КАК ОстаткиНаКартеОстатки";
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл 	
		Константы = Константы + Выборка.СуммаСписанияОстаток;			
	КонецЦикла;
	
	Константы.БалансКарты.Установить(Константы);	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьБалансКарты(Команда)
	ЗаписатьБалансКартыНаСервере();
КонецПроцедуры

#КонецОбласти
