
&НаСервере
Процедура ЗапуститьОбработкуНаСервере()
	
	КвалСтр = Новый КвалификаторыСтроки(100);
	КвалУИС = Новый КвалификаторыСтроки(36);
	Массив	= Новый Массив;	
	Выборка = Справочники.Сотрудники.Выбрать();
	Счет 	= 0;
	
	Массив.Добавить(Тип("Строка"));
	ОписаниеТипаСтроки = Новый ОписаниеТипов(Массив,,,, КвалСтр);
	Массив.Очистить();
	Массив.Добавить(Тип("УникальныйИдентификатор"));
	ОписаниеТипаУникИнд = Новый ОписаниеТипов(Массив);
	Массив.Очистить();
	Массив.Добавить(Тип("Строка"));
	ОписаниеТипаУникИндСтр = Новый ОписаниеТипов(Массив,,,, КвалУИС);
	
	ТаблицаЗначений = Новый ТаблицаЗначений;
	ТаблицаЗначений.Колонки.Добавить("Пользователь", ОписаниеТипаСтроки, "Пользователь");
	ТаблицаЗначений.Колонки.Добавить("УникальныйИдентификатор", ОписаниеТипаСтроки, "Уникальный идентификатор");
	
	ВсеПользователи = ПользователиИнформационнойБазы.ПолучитьПользователей();
	
	Пока Выборка.Следующий() Цикл
		
		Для Каждого ПользовательИБ Из ВсеПользователи Цикл
			
			Если ПользовательИБ.ПолноеИмя = Выборка.Код Тогда
				
				СотрудникОбъект = Выборка.ПолучитьОбъект();
				СотрудникОбъект.ИдентификаторПользователяИБ = ПользовательИБ.УникальныйИдентификатор;
				СотрудникОбъект.Записать();
				
				НоваяСтрока = ТаблицаЗначений.Добавить();
				НоваяСтрока.Пользователь = Выборка.Код;
				НоваяСтрока.УникальныйИдентификатор = Строка(ПользовательИБ.УникальныйИдентификатор);
								
				Счет = Счет + 1;
				
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Для Каждого Стр Из ТаблицаЗначений Цикл
		Сообщить("| Пользователь | " + Стр.Пользователь + " | Ключ | " 
		+ Стр.УникальныйИдентификатор + " | Тип ключа | " + ТипЗнч(Стр.УникальныйИдентификатор));
	КонецЦикла;
	
	Сообщить("Готово! Найдено " + Счет + " Пользователей!");
	
	Результат.Загрузить(ТаблицаЗначений);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьОбработку(Команда)
	ЗапуститьОбработкуНаСервере();	
КонецПроцедуры
