
Процедура СотрудникПолучилЗадачуПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	// . . .	
КонецПроцедуры

Процедура СотрудникПолучилЗадачуОбработкаПроверкиВыполнения(ТочкаМаршрутаБизнесПроцесса, Задача, Результат)
	
	//// Проверяем все ли задачи выполнены
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ ПЕРВЫЕ 1
	//|	Созвон.Ссылка
	//|ИЗ
	//|	Задача.Созвон КАК Созвон
	//|ГДЕ
	//|	Созвон.БизнесПроцесс = &БизнесПроцесс
	//|	И НЕ Созвон.Выполнена";
	//
	//Запрос.УстановитьПараметр("БизнесПроцесс", ЭтотОбъект.Ссылка);
	//
	//// Если невыполненных задач нет — точка выполнена
	//РезультатПроверки = Запрос.Выполнить().Пустой();
	
КонецПроцедуры

Процедура СотрудникПолучилЗадачуПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	СтандартнаяОбработка = Ложь;
	ИнициаторСозвона	 = ПользователиИнформационнойБазы.ТекущийПользователь().Имя;
	
	//ФормируемыеЗадачи = Новый Массив;	
	СписокСотрудников = Новый Массив;
	Счет			  = 0;
	
	Для Каждого СтрокаСотрудника Из Сотрудники Цикл 
		СписокСотрудников.Добавить(СтрокаСотрудника.Сотрудник);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УчетныеЗаписиTelegram.ID КАК ID,
	|	УчетныеЗаписиTelegram.Сотрудник КАК Сотрудник
	|ИЗ
	|	Справочник.УчетныеЗаписиTelegram КАК УчетныеЗаписиTelegram
	|ГДЕ
	|	ВЫРАЗИТЬ(УчетныеЗаписиTelegram.Сотрудник КАК Справочник.Сотрудники) В (&СписокСотрудников)
	|	И НЕ УчетныеЗаписиTelegram.ПометкаУдаления";
	Запрос.УстановитьПараметр("СписокСотрудников", СписокСотрудников);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	TelegramПоСотруднику = Новый Соответствие;
	
	Пока Выборка.Следующий() Цикл 
		TelegramПоСотруднику.Вставить(Выборка.Сотрудник, Выборка.ID);
	КонецЦикла;
	
	Для Каждого СтрокаСотрудника Из Сотрудники Цикл 
		
		Счет = Счет + 1;
		
		НоваяЗадача = Задачи.Созвон.СоздатьЗадачу();
		НоваяЗадача.Исполнитель = СтрокаСотрудника.Сотрудник;
		НоваяЗадача.БизнесПроцесс = ЭтотОбъект.Ссылка;
		НоваяЗадача.Дата = ТекущаяДата(); 
		
		Уведомление = "Вам назначен созвон " + Формат(ДатаСозвона, "ДФ='дд.ММ.гггг ЧЧ:мм'") 
		+ " от пользователя " + ИнициаторСозвона;
		
		НоваяЗадача.Наименование = Уведомление;
		
		ФормируемыеЗадачи[0].Наименование = Уведомление;
		
		TelegramID = TelegramПоСотруднику[СтрокаСотрудника.Сотрудник];
		
		Если TelegramID <> Неопределено Тогда 
			МодульTelegram.SendMessage(TelegramID, НоваяЗадача.Наименование + Символы.ПС + "Ссылка на созвон: " + СсылкаНаСозвон);
		Иначе 
			Сообщить("Не найден Telegram для сотрудника: " + СтрокаСотрудника.Сотрудник);
		КонецЕсли;
		
	КонецЦикла;
	
	Сообщить("Исполнитель: " + НоваяЗадача.Исполнитель + " / " + НоваяЗадача.Исполнитель.ИдентификаторПользователяИБ);
	
КонецПроцедуры

Процедура ЗавершениеПриЗавершении(ТочкаМаршрутаБизнесПроцесса, Отказ) Экспорт 
	
	ИнициаторСозвона = СокрЛП(ПользователиИнформационнойБазы.ТекущийПользователь().ПолноеИмя);
	
	Сотрудник = Справочники.Сотрудники.НайтиПоКоду(ИнициаторСозвона);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УчетныеЗаписиTelegram.ID КАК ID,
	|	УчетныеЗаписиTelegram.Сотрудник КАК Сотрудник
	|ИЗ
	|	Справочник.УчетныеЗаписиTelegram КАК УчетныеЗаписиTelegram
	|ГДЕ
	|	ВЫРАЗИТЬ(УчетныеЗаписиTelegram.Сотрудник КАК Справочник.Сотрудники) В (&Сотрудник)
	|	И НЕ УчетныеЗаписиTelegram.ПометкаУдаления";
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка			 = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда 
		
		Уведомление = "Здравствуйте, " + СокрЛП(ИнициаторСозвона) + "!"
		+ Символы.ПС + "Уведомляю вас, что все сотруднки были оповещены о созвоне!";
		
		МодульTelegram.SendMessage(Выборка.ID, Уведомление);
		
	КонецЕсли;
	
КонецПроцедуры
