
#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.Код.Маска = "99.99.99";
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Не СоответствуетМаске(Объект.Код) Тогда 
		
		ПредупреждениеАсинх("Код должен быть в формате 00.00.00, например: 09.03.04",
		, "Неправильный код!");
		
		Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область РаботаФормы

&НаКлиенте
Функция ЭтоЦифры(Строка)
    
    Для Счет = 1 По СтрДлина(Строка) Цикл
		
		Символ = Сред(Строка, Счет, 1);
		
		Если Найти("0123456789", Символ) = 0 Тогда
            Возврат Ложь;
        КонецЕсли;
		
	КонецЦикла;
    
    Возврат Истина;
    
КонецФункции

&НаКлиенте
Функция СоответствуетМаске(Код)
    
    Если СтрДлина(Код) <> 8 Тогда
        Возврат Ложь;
    КонецЕсли;
    
    Если Сред(Код, 3, 1) <> "." Или Сред(Код, 6, 1) <> "." Тогда
        Возврат Ложь;
    КонецЕсли;
    
    Возврат ЭтоЦифры(Лев(Код, 2)) 
        И ЭтоЦифры(Сред(Код, 4, 2)) 
        И ЭтоЦифры(Прав(Код, 2));
    
КонецФункции

#КонецОбласти
